docs/benchmark/results/apisix/passthrough_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/joey/api-gateway/lumen-gateway/docs/benchmark/k6/passthrough.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * constant_load: 100 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 11476 complete and 0 interrupted iterations
constant_load   [   3% ] 100 VUs  01.0s/30s

running (0m02.0s), 100/100 VUs, 23772 complete and 0 interrupted iterations
constant_load   [   7% ] 100 VUs  02.0s/30s

running (0m03.0s), 100/100 VUs, 36377 complete and 0 interrupted iterations
constant_load   [  10% ] 100 VUs  03.0s/30s

running (0m04.0s), 100/100 VUs, 50106 complete and 0 interrupted iterations
constant_load   [  13% ] 100 VUs  04.0s/30s

running (0m05.0s), 100/100 VUs, 63857 complete and 0 interrupted iterations
constant_load   [  17% ] 100 VUs  05.0s/30s

running (0m06.0s), 100/100 VUs, 76993 complete and 0 interrupted iterations
constant_load   [  20% ] 100 VUs  06.0s/30s

running (0m07.0s), 100/100 VUs, 91472 complete and 0 interrupted iterations
constant_load   [  23% ] 100 VUs  07.0s/30s

running (0m08.0s), 100/100 VUs, 103875 complete and 0 interrupted iterations
constant_load   [  27% ] 100 VUs  08.0s/30s

running (0m09.0s), 100/100 VUs, 117030 complete and 0 interrupted iterations
constant_load   [  30% ] 100 VUs  09.0s/30s

running (0m10.0s), 100/100 VUs, 129631 complete and 0 interrupted iterations
constant_load   [  33% ] 100 VUs  10.0s/30s

running (0m11.0s), 100/100 VUs, 140874 complete and 0 interrupted iterations
constant_load   [  37% ] 100 VUs  11.0s/30s

running (0m12.0s), 100/100 VUs, 153982 complete and 0 interrupted iterations
constant_load   [  40% ] 100 VUs  12.0s/30s

running (0m13.0s), 100/100 VUs, 167496 complete and 0 interrupted iterations
constant_load   [  43% ] 100 VUs  13.0s/30s

running (0m14.0s), 100/100 VUs, 181230 complete and 0 interrupted iterations
constant_load   [  47% ] 100 VUs  14.0s/30s

running (0m15.0s), 100/100 VUs, 195755 complete and 0 interrupted iterations
constant_load   [  50% ] 100 VUs  15.0s/30s

running (0m16.0s), 100/100 VUs, 209179 complete and 0 interrupted iterations
constant_load   [  53% ] 100 VUs  16.0s/30s

running (0m17.0s), 100/100 VUs, 219645 complete and 0 interrupted iterations
constant_load   [  57% ] 100 VUs  17.0s/30s

running (0m18.0s), 100/100 VUs, 233202 complete and 0 interrupted iterations
constant_load   [  60% ] 100 VUs  18.0s/30s

running (0m19.0s), 100/100 VUs, 247394 complete and 0 interrupted iterations
constant_load   [  63% ] 100 VUs  19.0s/30s

running (0m20.0s), 100/100 VUs, 262219 complete and 0 interrupted iterations
constant_load   [  67% ] 100 VUs  20.0s/30s

running (0m21.0s), 100/100 VUs, 274174 complete and 0 interrupted iterations
constant_load   [  70% ] 100 VUs  21.0s/30s

running (0m22.0s), 100/100 VUs, 287457 complete and 0 interrupted iterations
constant_load   [  73% ] 100 VUs  22.0s/30s

running (0m23.0s), 100/100 VUs, 298391 complete and 0 interrupted iterations
constant_load   [  77% ] 100 VUs  23.0s/30s

running (0m24.0s), 100/100 VUs, 310313 complete and 0 interrupted iterations
constant_load   [  80% ] 100 VUs  24.0s/30s

running (0m25.0s), 100/100 VUs, 324042 complete and 0 interrupted iterations
constant_load   [  83% ] 100 VUs  25.0s/30s

running (0m26.0s), 100/100 VUs, 337306 complete and 0 interrupted iterations
constant_load   [  87% ] 100 VUs  26.0s/30s

running (0m27.0s), 100/100 VUs, 349156 complete and 0 interrupted iterations
constant_load   [  90% ] 100 VUs  27.0s/30s

running (0m28.0s), 100/100 VUs, 359689 complete and 0 interrupted iterations
constant_load   [  93% ] 100 VUs  28.0s/30s

running (0m29.0s), 100/100 VUs, 373065 complete and 0 interrupted iterations
constant_load   [  97% ] 100 VUs  29.0s/30s

running (0m30.0s), 100/100 VUs, 384469 complete and 0 interrupted iterations
constant_load   [ 100% ] 100 VUs  30.0s/30s


  █ TOTAL RESULTS 

    checks_total.......: 769498  25646.281303/s
    checks_succeeded...: 100.00% 769498 out of 769498
    checks_failed......: 0.00%   0 out of 769498

    ✓ status is 200
    ✓ body is not empty

    HTTP
    http_req_duration..............: avg=7.73ms min=310µs    max=99.67ms p(50)=5.51ms p(75)=8.17ms p(95)=23.21ms p(99)=38.66ms count=384749
      { expected_response:true }...: avg=7.73ms min=310µs    max=99.67ms p(50)=5.51ms p(75)=8.17ms p(95)=23.21ms p(99)=38.66ms count=384749
    http_req_failed................: 0.00%  0 out of 384749
    http_reqs......................: 384749 12823.140651/s

    EXECUTION
    iteration_duration.............: avg=7.79ms min=339.45µs max=99.74ms p(50)=5.57ms p(75)=8.23ms p(95)=23.28ms p(99)=38.72ms count=384749
    iterations.....................: 384749 12823.140651/s
    vus............................: 100    min=100         max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 375 MB 13 MB/s
    data_sent......................: 124 MB 4.1 MB/s



running (0m30.0s), 000/100 VUs, 384749 complete and 0 interrupted iterations
constant_load ✓ [ 100% ] 100 VUs  30s