docs/benchmark/results/apisix/passthrough_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/joey/api-gateway/lumen-gateway/docs/benchmark/k6/passthrough.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * constant_load: 100 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 8792 complete and 0 interrupted iterations
constant_load   [   3% ] 100 VUs  01.0s/30s

running (0m02.0s), 100/100 VUs, 18969 complete and 0 interrupted iterations
constant_load   [   7% ] 100 VUs  02.0s/30s

running (0m03.0s), 100/100 VUs, 28989 complete and 0 interrupted iterations
constant_load   [  10% ] 100 VUs  03.0s/30s

running (0m04.0s), 100/100 VUs, 37748 complete and 0 interrupted iterations
constant_load   [  13% ] 100 VUs  04.0s/30s

running (0m05.0s), 100/100 VUs, 48127 complete and 0 interrupted iterations
constant_load   [  17% ] 100 VUs  05.0s/30s

running (0m06.0s), 100/100 VUs, 57937 complete and 0 interrupted iterations
constant_load   [  20% ] 100 VUs  06.0s/30s

running (0m07.0s), 100/100 VUs, 67755 complete and 0 interrupted iterations
constant_load   [  23% ] 100 VUs  07.0s/30s

running (0m08.0s), 100/100 VUs, 78187 complete and 0 interrupted iterations
constant_load   [  27% ] 100 VUs  08.0s/30s

running (0m09.0s), 100/100 VUs, 87943 complete and 0 interrupted iterations
constant_load   [  30% ] 100 VUs  09.0s/30s

running (0m10.0s), 100/100 VUs, 97529 complete and 0 interrupted iterations
constant_load   [  33% ] 100 VUs  10.0s/30s

running (0m11.0s), 100/100 VUs, 106670 complete and 0 interrupted iterations
constant_load   [  37% ] 100 VUs  11.0s/30s

running (0m12.0s), 100/100 VUs, 115421 complete and 0 interrupted iterations
constant_load   [  40% ] 100 VUs  12.0s/30s

running (0m13.0s), 100/100 VUs, 126144 complete and 0 interrupted iterations
constant_load   [  43% ] 100 VUs  13.0s/30s

running (0m14.0s), 100/100 VUs, 135774 complete and 0 interrupted iterations
constant_load   [  47% ] 100 VUs  14.0s/30s

running (0m15.0s), 100/100 VUs, 145747 complete and 0 interrupted iterations
constant_load   [  50% ] 100 VUs  15.0s/30s

running (0m16.0s), 100/100 VUs, 155109 complete and 0 interrupted iterations
constant_load   [  53% ] 100 VUs  16.0s/30s

running (0m17.0s), 100/100 VUs, 165412 complete and 0 interrupted iterations
constant_load   [  57% ] 100 VUs  17.0s/30s

running (0m18.0s), 100/100 VUs, 175510 complete and 0 interrupted iterations
constant_load   [  60% ] 100 VUs  18.0s/30s

running (0m19.0s), 100/100 VUs, 185159 complete and 0 interrupted iterations
constant_load   [  63% ] 100 VUs  19.0s/30s

running (0m20.0s), 100/100 VUs, 193065 complete and 0 interrupted iterations
constant_load   [  67% ] 100 VUs  20.0s/30s

running (0m21.0s), 100/100 VUs, 198033 complete and 0 interrupted iterations
constant_load   [  70% ] 100 VUs  21.0s/30s

running (0m22.0s), 100/100 VUs, 203836 complete and 0 interrupted iterations
constant_load   [  73% ] 100 VUs  22.0s/30s

running (0m23.0s), 100/100 VUs, 211435 complete and 0 interrupted iterations
constant_load   [  77% ] 100 VUs  23.0s/30s

running (0m24.0s), 100/100 VUs, 220021 complete and 0 interrupted iterations
constant_load   [  80% ] 100 VUs  24.0s/30s

running (0m25.0s), 100/100 VUs, 227440 complete and 0 interrupted iterations
constant_load   [  83% ] 100 VUs  25.0s/30s

running (0m26.0s), 100/100 VUs, 236332 complete and 0 interrupted iterations
constant_load   [  87% ] 100 VUs  26.0s/30s

running (0m27.0s), 100/100 VUs, 245877 complete and 0 interrupted iterations
constant_load   [  90% ] 100 VUs  27.0s/30s

running (0m28.0s), 100/100 VUs, 256232 complete and 0 interrupted iterations
constant_load   [  93% ] 100 VUs  28.0s/30s

running (0m29.0s), 100/100 VUs, 265804 complete and 0 interrupted iterations
constant_load   [  97% ] 100 VUs  29.0s/30s

running (0m30.0s), 100/100 VUs, 274804 complete and 0 interrupted iterations
constant_load   [ 100% ] 100 VUs  30.0s/30s


  █ TOTAL RESULTS 

    checks_total.......: 550122  18333.631828/s
    checks_succeeded...: 100.00% 550122 out of 550122
    checks_failed......: 0.00%   0 out of 550122

    ✓ status is 200
    ✓ body is not empty

    HTTP
    http_req_duration..............: avg=10.83ms min=469µs    max=316.17ms p(50)=9ms    p(75)=12.89ms p(95)=22.27ms p(99)=37.42ms count=275061
      { expected_response:true }...: avg=10.83ms min=469µs    max=316.17ms p(50)=9ms    p(75)=12.89ms p(95)=22.27ms p(99)=37.42ms count=275061
    http_req_failed................: 0.00%  0 out of 275061
    http_reqs......................: 275061 9166.815914/s

    EXECUTION
    iteration_duration.............: avg=10.89ms min=504.29µs max=316.22ms p(50)=9.07ms p(75)=12.96ms p(95)=22.35ms p(99)=37.59ms count=275061
    iterations.....................: 275061 9166.815914/s
    vus............................: 100    min=100         max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 268 MB 8.9 MB/s
    data_sent......................: 89 MB  3.0 MB/s



running (0m30.0s), 000/100 VUs, 275061 complete and 0 interrupted iterations
constant_load ✓ [ 100% ] 100 VUs  30s